@synergiator 

Not able to reproduce the issue able to deploy instance by giving the template name, tested on the latest cloudstack 4.19 release.

Let me know if i can go ahead and close the issue 

 ```
 # cloudstack_instance.test-vm will be created
  + resource "cloudstack_instance" "test-vm" {
      + display_name     = (known after apply)
      + expunge          = true
      + group            = (known after apply)
      + id               = (known after apply)
      + ip_address       = (known after apply)
      + name             = "hyd-demo-test"
      + network_id       = (known after apply)
      + project          = (known after apply)
      + root_disk_size   = (known after apply)
      + service_offering = "9c870dca-a857-468c-a804-29b256af6b53"
      + start_vm         = true
      + tags             = (known after apply)
      + template         = "Centos7"
      + zone             = "49e9ad34-8a3d-4f87-8ff5-90d65859f839"
    }
    
```
    